import { Heading, Text, VStack } from '@chakra-ui/react';
import Head from 'next/head';

export default function PrivacyPolicy() {
  return (
    <>
      <Head>
        <title>개인정보처리방침</title>
      </Head>
      <VStack as="main" flexDir="column" w="1080px" mx="auto" gap="28px">
        <Heading textStyle="h2" fontWeight="bold" color="gray800">
          개인정보처리방침
        </Heading>

        <Text whiteSpace="pre-line" textStyle="t1" fontWeight="regular" color="#000">
          {`gnimty.lol('이하 '회사')에서 제공하는 인터넷 서비스(이하 "서비스")는 회원님의 개인정보를 중요시하며, 개인정보의 보호와 관련하여 정보통신망 이용촉진 및 정보보호 등에 관한 법률, 개인정보 보호법, 전기통신사업법, 통신비밀보호법 등 개인정보와 관련된 법령 상의 개인정보 보호 규정 및 방송통신위원회가 제정한 개인정보보호지침을 준수하고 있습니다.

회사는 개인정보취급방침을 통하여 회원님들의 개인정보가 남용되거나 유출되지 않도록 최선을 다할 것이며, 회원님께서 제공하시는 개인정보가 어떠한 용도와 방식으로 이용되고 있고, 개인정보보호를 위해 어떠한 조치가 취해지고 있는지 알려드리고자 합니다.

단, 본 개인정보 취급방침은 정부의 법령 및 지침의 변경, 또는 보다 나은 서비스의 제공을 위하여 그 내용이 변경될 수 있으니, 회원님들께서는 사이트 방문 시 수시로 그 내용을 확인하여 주시기 바라며, 회사는 개인정보취급방침을 개정하는 경우 웹사이트 공지사항 또는 개별공지를 통하여 공지할 것입니다.

제 1 조 (개인정보의 수집 및 이용목적)
회사가 개인정보를 수집하는 목적은 이용자의 이용의사를 확인하여 최적화되고 맞춤화된 서비스를 제공하기 위함입니다. 회사는 최초 회원가입 시 서비스 제공을 원활하게 하기 위해 필요한 최소한의 정보만을 수집하고 있습니다.
회사는 개인정보를 수집 및 이용목적 이외에 다른 용도로 이를 이용하거나 이용자의 동의 없이 제3자에게 제공하지 않습니다.
회사는 수집한 개인정보를 다음의 목적을 위해 활용합니다. 회원 가입의사 확인, 회원자격 유지·관리, 서비스 부정이용 방지, 각종 고지·통지, 콘텐츠 제공, 맞춤서비스 제공, 신규 서비스 개발 및 맞춤 서비스 제공, 회원의 서비스 이용에 대한 통계 등을 목적으로 개인정보를 처리합니다.
회사는 이용자의 개인정보를 수집할 경우 반드시 이용자의 동의를 얻어 수집하며, 이용자의 기본적 인권을 침해할 우려가 있는 인종, 출신지, 본적지, 사상, 정치적 성향, 범죄기록, 건강상태 등의 정보는 이용자의 동의 또는 법령의 규정에 의한 경우 이외에는 수집하지 않습니다.


제 2 조 (수집하는 개인정보의 항목)
회사는 회원가입, 서비스 이용 등을 위해 아래와 같은 개인정보를 수집하고 있으며 필요한 최소한의 정보만을 수집합니다. 수집 항목: 이메일 주소, 쿠키, 브라우저 종류 및 OS버전
회사는 고객님의 선택에 따라 소셜 로그인(이하 “OAuth“라고 함)을 사용할 수 있도록 하고 있습니다. Google, Kakao, RiotGames (OAuth Service 제공자)의 OAuth 서비스를 이용하고자 할 경우 다음의 필수 정보를 입력해야 합니다. 가. 이용자 ID : Oauth를 제공하는 서비스의 사용자 ID 나. 이메일 및 패스워드 : OAuth를 제공하는 서비스에 등록되고 접근이 허락된 사용자 이메일 및 패스워드 정보
OAuth 서비스 이용 과정에서 자동생성 되어 저장되는 정보는 아래와 같습니다. 가. OAuth 서비스 제공자에게 전달받은 Token 정보
OAuth 서비스의 이용을 원치 않는 경우 언제든지 연결 해제 버튼을 클릭하여 연결을 해제할 수 있으며, 이 경우 저장되어 있던 Token 정보는 삭제됩니다.

제 3 조 (개인정보 수집에 대한 동의)
회사는 귀하께서 회사의 개인정보처리방침 또는 이용약관의 내용에 대해 「동의한다」버튼 또는 「동의하지 않는다」버튼을 클릭할 수 있는 절차를 마련하여, 「동의한다」버튼을 클릭하면 개인정보 수집에 대해 동의한 것으로 봅니다. 단, 회사는 다음 각 호의 어느 하나에 해당하는 경우에는 법령에 따라 이와 같은 동의 없이 이용자의 개인정보를 수집∙이용할 수 있습니다.
정보통신서비스의 제공에 관한 계약을 이행하기 위하여 필요한 개인정보로서 경제적 · 기술적인 사유로 통상적인 동의를 받는 것이 뚜렷하게 곤란한 경우
정보통신서비스의 제공에 따른 요금정산을 위하여 필요한 경우
그 밖에 법률에 특별한 규정이 있는 경우

제 4 조 (쿠키에 의한 개인정보 수집)
쿠키(cookie)는 웹사이트가 귀하의 컴퓨터 브라우저(넷스케이프, 인터넷 익스플로러 등)로 전송하는 소량의 정보입니다. 회사는 귀하에 대한 정보를 저장하고 수시로 찾아내는 ‘쿠키(cookie)’를 사용합니다. 쿠키는 귀하의 컴퓨터는 식별하지만 귀하를 개인적으로 식별하지는 않습니다. 또한 귀하는 쿠키에 대한 선택권이 있습니다.
웹브라우저 상단의 도구 > 인터넷옵션 탭(option tab)에서 모든 쿠키를 다 받아들이거나, 쿠키가 설치될 때 통지를 보내도록 하거나, 아니면 모든 쿠키를 거부할 수 있는 선택권을 가질 수 있습니다.

제 5 조 (개인정보 보호책임자)
회사는 개인정보 처리에 관한 업무를 총괄해서 책임지고, 개인정보 처리와 관련한 정보주체의 불만처리 및 피해구제 등을 위하여 아래와 같이 개인정보 보호책임자를 지정하고 있습니다. 회사의 서비스(또는 사업)을 이용하시면서 발생한 모든 개인정보 보호 관련 문의, 불만처리, 피해구제 등에 관한 사항을 개인정보 보호책임자 및 회사로 문의하실 수 있으며, 회사는 이용자의 문의에 대해 지체 없이 답변 및 처리해 드릴 것입니다.
개인정보 보호책임자
성명 : 김솔민
직급 : 대표
연락처 : 010 – XXXX - XXXX

고객님은 회사의 서비스 이용 중 발생하는 모든 개인정보보호 관련 민원을 개인정보보호책임자 및 담당부서로 문의하실 수 있습니다. 회사는 고객님의 신고사항에 대해 신속하게 충분한 답변을 드릴 것입니다.
기타 개인정보침해에 대한 신고나 상담이 필요하신 경우에는 아래 기관에 문의하시기 바랍니다.
개인정보분쟁조정위원회 (http://kopico.go.kr / 국번없이 1833-6972)
개인정보침해신고센터 (http://privacy.kisa.or.kr / 국번없이 118)
대검찰청 사이버수사과 (http://www.spo.go.kr / 국번없이 1301)
경찰청사이버수사국 (https://ecrm.cyber.go.kr / 국번없이 182)


[부칙]
(시행일) 이 약관은 YYYY년 MM월 DD일부터 시행합니다.`}
        </Text>
      </VStack>
    </>
  );
}
