import { VStack, Text, Heading } from '@chakra-ui/react';
import Head from 'next/head';

export default function TermsOfService() {
  return (
    <>
      <Head>
        <title>이용 약관</title>
      </Head>
      <VStack as="main" flexDir="column" w="1080px" mx="auto" gap="28px">
        <Heading textStyle="h2" fontWeight="bold" color="gray800">
          이용 약관
        </Heading>

        <Text whiteSpace="pre-line" textStyle="t1" fontWeight="regular" color="#000">
          {`제 1 장 총칙
제 1 조 (목적)
본 약관은 Gnimty (이하 “회사”)가 제공하는 웹 서비스 “gnimty.lol”에서 제공하는 서비스 (이하 “서비스”)를 이용함에 있어서 당사자의 권리 의무 및 책임사항을 규정하는 것을 목적으로 합니다.

제 2 조 (약관의 효력 및 변경)
이 약관은 서비스 화면이나 이메일 전송 등의 방법으로 이용고객에게 공지함으로써 효력을 발생합니다.
사이트는 이 약관의 내용을 변경할 수 있으며, 변경된 약관은 제1항과 같은 방법으로 공지 또는 통지함으로써 효력을 발생합니다.

제 3 조 (용어의 정의).
회원 : 사이트와 서비스 이용계약을 체결하거나 이용자 아이디(email)를 부여받은 개인을 말합니다.
신청자 : 회원가입을 신청하는 개인을 말합니다.
아이디(email) : 회원의 식별과 서비스 이용을 위하여 회원이 정하고 사이트가 승인하는 로그인 이메일 정보를 말합니다.
비밀번호 : 회원 제공 및 서비스가 승인한 이메일와 일치된 회원임을 확인하고, 회원 자신의 비밀을 보호하기 위하여 회원이 정한 문자와 숫자의 조합을 말합니다.
해지 : 사이트 또는 회원이 서비스 이용계약을 취소하여 회원탈퇴를 하는 행위를 말합니다.
제 2 장 서비스 이용계약

제 4 조 (이용계약의 성립)
이용약관은 회원가입 시 노출되는 이용약관 하단의 동의 버튼을 누르면 이 약관에 동의하는 것으로 간주됩니다.
이용계약은 서비스 이용희망자의 이용약관 및 개인정보처리방침 동의 후 이용 신청에 대하여 사이트가 승낙함으로써 성립합니다.

제 3 장 계약 당사자의 의무
제 5 조 (사이트의 의무)
사이트는 회원에게 각 호의 서비스를 제공합니다. 가. 신규서비스와 도메인 정보에 대한 공지메일 발송 나. 추가 도메인 등록시 개인정보 자동 입력
사이트는 서비스 제공과 관련하여 취득한 회원의 개인정보를 회원의 동의없이 타인에게 누설,공개 또는 배포할 수 없으며, 서비스관련 업무 이외의 상업적 목적으로 사용할 수 없습니다. 단, 다음 각 호의 1에 해당하는 경우는 예외입니다. 가. 전기통신기본법 등 법률의 규정에 의해 국가기관의 요구가 있는 경우 나. 범죄에 대한 수사상의 목적이 있거나 정보통신윤리 위원회의 요청이 있는 경우 다. 기타 관계법령에서 정한 절차에 따른 요청이 있는 경우
사이트는 이 약관에서 정한 바에 따라 지속적, 안정적으로 서비스를 제공할 의무가 있습니다.
사이트에서 제공하는 게임 데이터는 Riot Developer API로부터 정적 데이터를 활용하며, Riot Developer Portal(https://developer.riotgames.com/docs/lol)의 개발자 API 정책에 따라서 다음과 같은 사항을 준수합니다.
서비스는 어떤 법률도 위반해서는 안 됩니다.
Riot의 지적 재산(“이하 Riot IP”)을 활용하여 게임을 개발하지 않습니다.
암호화폐나 블록체인 기술을 활용하지 않습니다.
API와 다른 제삼자 회사 간에 데이터를 사고파는 중개자 ("이하 데이터 브로커")로 작동하는 앱을 만들어서는 안 됩니다.
서비스는 게임의 정적 데이터에 한정된 IP 이외에 어떠한 지적 재산도 사용하지 않습니다.

제 6 조 (회원의 의무)
회원은 서비스 이용 시 다음 각 호의 행위를 하지 않아야 합니다. 가. 다른 회원의 ID를 부정하게 사용하는 행위 나. 서비스에서 얻은 정보를 사이트의 사전승낙 없이 회원의 이용 이외의 목적으로 복제하거나 이를 변경, 출판 및 방송 등에 사용하거나 타인에게 제공하는 행위 다. 사이트의 저작권, 타인의 저작권 등 기타 권리를 침해하는 행위 라. 공공질서 및 미풍양속에 위반되는 내용의 정보, 문장, 도형 등을 타인에게 유포하는 행위 마. 범죄와 결부된다고 객관적으로 판단되는 행위 바. 기타 관계법령에 위배되는 행위
회원은 관계법령, 이 약관에서 규정하는 사항, 서비스 이용 안내 및 주의 사항을 준수하여야 합니다.
회원은 내용별로 사이트가 서비스 공지사항에 게시하거나 별도로 공지한 이용 제한 사항을 준수하여야 합니다.

제 4 장 서비스 제공 및 이용
제 7 조 (회원 아이디와 비밀번호 관리에 대한 회원의 의무)
아이디와 비밀번호에 대한 모든 관리는 회원에게 책임이 있습니다. 회원에게 부여된 아이디와 비밀번호의 관리소홀, 부정사용에 의하여 발생하는 모든 결과에 대한 전적인 책임은 회원에게 있습니다.
자신의 아이디가 부정하게 사용된 경우 또는 기타 보안 위반에 대하여, 회원은 반드시 사이트에 그 사실을 통보해야 합니다.
제 8 조 (서비스 제한 및 정지)
사이트는 전시, 사변, 천재지변 또는 이에 준하는 국가비상사태가 발생하거나 발생할 우려가 있는 경우와 전기통신사업법에 의한 기간통신 사업자가 전기통신서비스를 중지하는 등 기타 불가항력적 사유가 있는 경우에는 서비스의 전부 또는 일부를 제한하거나 정지할 수 있습니다.
사이트는 제1항의 규정에 의하여 서비스의 이용을 제한하거나 정지할 때에는 그 사유 및 제한기간 등을 지체없이 회원에게 알려야 합니다.
제5장 계약사항의 변경, 해지
제 9 조 (정보의 변경) 회원이 주소, 비밀번호 등 고객정보를 변경하고자 하는 경우에는 홈페이지의 회원정보 변경 서비스를 이용하여 변경할 수 있습니다.
제 10 조 (계약사항의 해지) 회원은 서비스 이용계약을 해지할 수 있으며, 해지할 경우에는 본인이 직접 마이페이지 > 회원탈퇴 기능을 통해 사이트에 해지신청을 하여야 합니다. 사이트는 해지신청이 접수된 당일부터 해당 회원의 서비스 이용을 제한합니다. 사이트는 회원이 다음 각 항의 1에 해당하여 이용계약을 해지하고자 할 경우에는 해지조치 7일 전까지 그 뜻을 이용고객에게 통지하여 소명할 기회를 주어야 합니다.
이용고객이 이용제한 규정을 위반하거나 그 이용제한 기간 내에 제한 사유를 해소하지 않는 경우
정보통신윤리위원회가 이용해지를 요구한 경우
이용고객이 정당한 사유 없이 의견진술에 응하지 아니한 경우
타인 명의로 신청을 하였거나 신청서 내용의 허위 기재 또는 허위서류를 첨부하여 이용계약을 체결한 경우
제 11 조 (관할법원)
서비스와 관련하여 사이트와 회원간에 분쟁이 발생할 경우 사이트의 본사 소재지를 관할하는 법원을 관할법원으로 합니다.
[부칙]
(시행일) 이 약관은 YYYY년 MM월 DD일부터 시행합니다.`}
        </Text>
      </VStack>
    </>
  );
}
